import React, { use, useEffect, useState } from 'react';

// 자식 컴포넌트
export default function LifeCycleFunctionChild({ number }) {
    // {number}부모꺼 바로 넣어주면 알아서 구조분해할당됨

    /////////////////////

    // #1. Mount 시점에 실행 (return 생략 버전)
    //   ㄴ useEffect의 경우도 Hook 함수여서 () 필요! -> useEffect()
    useEffect(() => {
        console.log(console.log('컴포넌트 마운트!! 🔵 '));
    }, []);

    // #2. Mount 시점에 실행 (return)
    useEffect(() => {
        console.log(console.log('컴포넌트 마운트!! 🔵')); // = '효과함수' : 마운트와 업데이트 시 실행할 코드 작성
        return () => {
            console.log('컴포넌트 언마인트! 🔴'); // = '정리 함수' : 인마운트 또는 다음 useEffect 실행 전 호출
        };
    }, []); // 의존성 배열 : 배열에 지정된 값이 변경될 때 효과 함수가 실행됨

    /////////////////////

    // #3. Mount or Udate 시점에 실행 (의존성 배열 생략)
    useEffect(() => {
        console.log('컴포넌트 마운트!! 🔵 or 업데이트!! 🟢');
    });
    // 의존정 배열이 [] 빈 배열이므로 위의 #1과 #2는 랜더링될 때 '한번만 ' 실행됨
    //  ㄴ 하지만 의존성 배열을 생략하는 의미는 '매 랜더링 마다 실행'하겠다는 의미임. (=상태변경마다 매번 실행하겠다)

    /////////////////////

    // #4. input 상태가 업데이트 될 때 실행
    const [input, setInput] = useState('');
    useEffect(() => {
        console.log(
            '컴포넌트 마운트!! 🔵 or input 상태가 변경됨에 따라 컴포넌트 업데이트 🟠'
        );

        // #4-1) 다음 useEffect 실행 전 호출
        return () => {
            console.log('컴포넌트 언마운트!! 🔴');
        };
        // # 4-1 관련 추가 설명
        // -useEffect 가 실행될 때 이전 효과가 남아 있으면 중복된 효과가 발생할 수 있기 때문에 이전 효과를 먼저 제거한 후 새로운 효과 적용을 하기 위함임.
        ///////-------------///////////////

        // #5. 여러개의 useEffect
        //    - 하나의 컴포넌트 안에 여러개의 useEffect가 실행됨
        //    - React는 각각의 useEffect를 독립적으로 관리함
    }, [input]);
    //input 이 배열이 아니더라도 위와같이 [input] 의존성 배열에 추가할 수 있음
    // 문자열이든 숫자든 상관없이, 이 값이 변경될때마다 useEffect가 실행된다
    // 또한 배열형태이기 때문에 위와 같이 [input]1개만 써도 되고 2개이상 모두 가능! ex) [input, name, number...] > 배열중 1개가 수정되면 실행된다는 뜻임!

    return (
        <div>
            자식컴포넌트 <div>현재 number 값은 {number} 입니다.</div>
            <input
                type="text"
                value={input}
                onChange={(e) => {
                    setInput(e.target.value);
                }}
            />
            <div>{input}</div>
        </div>
    );
}
